package com.example.module_19.data

import com.example.module_19.R
import com.example.module_19.domain.Film

class MainRepository {

    val filmsDataBase = listOf(
        Film(
            "Веном 3 Последний танец",
            R.drawable.kino1,
            "Эдди Брок (Харди) и его верный симбиот Веном путешествуют по стране, разбираясь по пути с разными преступниками и негодяями. Однажды на их след выходят военные, которые хотят поймать Венома для проведения опытов. Им почти удается достигнуть своей цели, однако всё меняется, когда на Землю вторгается целая армия симбиотов, намеренная поработить всё человечество."
            , 9.5f),
        Film(
            "Крейвен-охотник",
            R.drawable.kino2,
            "Сергей Кравинов (Аарон Тейлор-Джонсон) — сын аристократа (Рассел Кроу), который был вынужден бежать из России в Штаты после Февральской революции 1917 года. Сергей, с одной стороны, является отличным охотником, а с другой, защищает мир животных от людей. Он не носит супергеройского трико. Чтобы получать сверхспособности, ему необходимо пить специальный отвар из африканских трав, но по-настоящему опасным его делают охотничьи таланты. Так он становится Крэйвеном-охотником. Чтобы доказать всем, что является альфа-самцом, он решается разобраться с крупной дичью — Человеком-пауком. Супергеройский блокбастер Джей Си Чендора («Самый жестокий год» и «Тройная граница») расширяет киновселенную Человека-паука и представляет одного из его самых опасных соперников."
            ,7.0f),
        Film(
            "Дэдпул и Росомаха",
            R.drawable.kino3,
            "Уэйд Уилсон попадает в организацию «Управление временными изменениями», что вынуждает его вернуться к своему альтер-эго Дэдпулу и изменить историю с помощью Росомахи."
            ,8.2f),
        Film(
            "Головоломка 2",
            R.drawable.kino4,
            "Мозг Райли внезапно подвергается капитальному ремонту в тот момент, когда необходимо освободить место для кое-чего совершенно неожиданного: новых эмоций. Радость, Грусть, Гнев, Страх и Отвращение никак не ожидали появления некой Тревожности. И похоже, не только её."
            ,8.4f),
        Film(
            "Дюна Часть вторая",
            R.drawable.kino5,
            "Герцог Пол Атрейдес присоединяется к фременам, чтобы стать Муад Дибом, одновременно пытаясь остановить наступление войны."
            ,8.7f),
        Film(
            "Артур, ты король",
            R.drawable.kino6,
            "Это было последнее соревнование капитана по приключенческим гонкам Майкла Лайта, он был полон решимости ничему не позволить встать у него на пути. Собрав первоклассную команду, он не мог и представить, что в 700-километровом забеге у них появится неожиданный попутчик — пес по кличке Артур, встреча с которым изменит не только исход гонки, но и их жизнь."
            ,8.1f),
        Film(
            "Человек-паук Паутина вселенных",
            R.drawable.kino7,
            "После воссоединения с Гвен Стейси дружелюбный сосед Человек-Паук попадает из Бруклина в Мультивселенную, где встречает команду Паучков, защищающих само её существование. Пытаясь справиться с новой угрозой, Майлз сталкивается с Пауками из других вселенных. Настаёт момент, когда ему необходимо решить, что значит быть героем, спасающим тех, кого любишь больше всего."
            ,8.8f),

        )
}